In [ ]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          785                 92
1        UAS1         Fisika                          365                 70
2        UTS2         Fisika                          586                 97
3        UAS2         Fisika                          235                 80
4        UTS1     Matematika                          303                 98
5        UAS1     Matematika                          571                 46
6        UTS2     Matematika                          772                 77
7        UAS2     Matematika                          402                 75
8        UTS1     Statistika                          354                 81
9        UAS1     Statistika                          341                 89
10       UTS2     Statistika                          303                 60
11       UAS2     Statistika                          568                 68



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [7]:
#code here
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)

df_sorted = df.sort_values(by='Rata2 Nilai Ujian', ascending=False)

print("Data setelah di-sorting berdasarkan Rata2Nilai:")
print(df_sorted)


nilai_terkecil = df_sorted['Rata2 Nilai Ujian'].min()
tipe_dan_mata_pelajaran_terkecil = df_sorted[df_sorted['Rata2 Nilai Ujian'] == nilai_terkecil]


print("\nTipe Ujian dan Mata Pelajaran dengan rata-rata nilai terkecil:")
print(tipe_dan_mata_pelajaran_terkecil[['Tipe Ujian', 'Mata Pelajaran']])

Data setelah di-sorting berdasarkan Rata2Nilai:
   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
11       UAS2     Statistika                          656                 98
6        UTS2     Matematika                          518                 93
8        UTS1     Statistika                          532                 85
3        UAS2         Fisika                          567                 84
5        UAS1     Matematika                          579                 77
10       UTS2     Statistika                          704                 75
0        UTS1         Fisika                          494                 72
9        UAS1     Statistika                          362                 65
4        UTS1     Matematika                          571                 50
7        UAS2     Matematika                          593                 46
1        UAS1         Fisika                          452                 43
2        UTS2         Fisika                          228                 41

Tipe Ujian dan Mata Pelajaran dengan rata-rata nilai terkecil:
  Tipe Ujian Mata Pelajaran
2       UTS2         Fisika

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

Pivoting adalah proses mengubah bentuk data dari format panjang menjadi format lebar atau sebaliknya
Melting adalah kebalikan dari pivoting. Ini adalah proses mengubah data dari format lebar menjadi format panjang



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [ ]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          403                 74
1        UAS1         Fisika                          618                 90
2        UTS2         Fisika                          757                 46
3        UAS2         Fisika                          213                 84
4        UTS1     Matematika                          699                 94
5        UAS1     Matematika                          350                 67
6        UTS2     Matematika                          755                 73
7        UAS2     Matematika                          572                 48
8        UTS1     Statistika                          567                 41
9        UAS1     Statistika                          508                 99
10       UTS2     Statistika                          242                 68
11       UAS2     Statistika                          443                 88

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [2]:
#code here
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
pivot_df = pd.pivot_table(df, values='Rata2 Nilai Ujian', index='Tipe Ujian', columns='Mata Pelajaran')

print("Dataframe setelah diubah bentuk:")
print(pivot_df)

Dataframe setelah diubah bentuk:
Mata Pelajaran  Fisika  Matematika  Statistika
Tipe Ujian
UAS1              48.0        44.0        46.0
UAS2              58.0        70.0        46.0
UTS1              54.0        55.0        80.0
UTS2              56.0        76.0        84.0

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [ ]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [4]:
#code here

import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')

df_melted = df.reset_index().melt(id_vars=['Hari'], var_name='Tempat_Hiburan', value_name='Jumlah_Pengunjung')


print(df_melted)

     Hari  Tempat_Hiburan  Jumlah_Pengunjung
0   Sabtu  Kebun Binatang                271
1  Minggu  Kebun Binatang                399
2   Sabtu           Dufan                501
3  Minggu           Dufan                700
4   Sabtu          Disney               1000
5  Minggu          Disney               1001
6   Sabtu            Bali                900
7  Minggu            Bali                803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [5]:
#code here
import pandas as pd

# Data setelah melting
data = {
    'Hari': ['Sabtu', 'Minggu', 'Sabtu', 'Minggu', 'Sabtu', 'Minggu', 'Sabtu', 'Minggu'],
    'Tempat_Hiburan': ['Kebun Binatang', 'Kebun Binatang', 'Dufan', 'Dufan', 'Disney', 'Disney', 'Bali', 'Bali'],
    'Jumlah_Pengunjung': [271, 399, 501, 700, 1000, 1001, 900, 803]
}

df_melted = pd.DataFrame(data)

# Melakukan binning menggunakan qcut
df_melted['Binning_Jumlah_Pengunjung'] = pd.qcut(df_melted['Jumlah_Pengunjung'], q=3, labels=['Rendah', 'Sedang', 'Tinggi'])

# Menampilkan data setelah binning
print(df_melted)

     Hari  Tempat_Hiburan  Jumlah_Pengunjung Binning_Jumlah_Pengunjung
0   Sabtu  Kebun Binatang                271                    Rendah
1  Minggu  Kebun Binatang                399                    Rendah
2   Sabtu           Dufan                501                    Rendah
3  Minggu           Dufan                700                    Sedang
4   Sabtu          Disney               1000                    Tinggi
5  Minggu          Disney               1001                    Tinggi
6   Sabtu            Bali                900                    Tinggi
7  Minggu            Bali                803                    Sedang

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---